import React from 'react';
import { AspectRatio } from '@/components/ui/aspect-ratio';
import { Button } from '@/components/ui/button';
import { ExternalLink, ShoppingBag, Utensils, Coffee, Pizza, Salad, Beef, Sandwich, Beer } from 'lucide-react';
import { useIsMobile } from '@/hooks/use-mobile';

// New menu items with Greek food
const menuItems = [
  {
    category: "Αλοιφές",
    icon: <Utensils className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Χτυπητή",
        description: "",
        price: "Από 0,50€"
      },
      {
        name: "Τζατζίκι",
        description: "Εδώ δεν χωράνε συστάσεις. Τζατζίκι, το κλασικό, το αληθινό, το αγαπημένο. Ζήτα άδεια από τους παρευρισκόμενους και κατανάλωσε εντελώς ανεύθυνα!",
        price: "Από 0,50€"
      },
      {
        name: "Ουγγαρέζα",
        description: "Στα σος κάθε γεύματος, οι σως που το συνοδεύουν!",
        price: "Από 0,50€"
      },
      {
        name: "Κηπουρού",
        description: "Στα σος κάθε γεύματος, οι σως που το συνοδεύουν!",
        price: "Από 0,50€"
      },
      {
        name: "Ρώσικη",
        description: "Στα σος κάθε γεύματος, οι σως που το συνοδεύουν!",
        price: "Από 0,50€"
      },
      {
        name: "Σως Pumba",
        description: "Στα σος κάθε γεύματος, οι σως που το συνοδεύουν!",
        price: "Από 0,50€"
      },
      {
        name: "Σως γιαουρτιού",
        description: "Στα σος κάθε γεύματος, οι σως που το συνοδεύουν!",
        price: "Από 0,50€"
      },
      {
        name: "Σως μουστάρδας",
        description: "Στα σος κάθε γεύματος, οι σως που το συνοδεύουν!",
        price: "Από 0,50€"
      },
      {
        name: "Αγγουρομαγιονέζα",
        description: "Στα σος κάθε γεύματος, οι σως που το συνοδεύουν!",
        price: "Από 0,50€"
      },
      {
        name: "Πάπρικα",
        description: "Στα σος κάθε γεύματος, οι σως που το συνοδεύουν!",
        price: "Από 0,50€"
      },
      {
        name: "Μαγιονέζα",
        description: "Λέγεται μαγιονέζα και θα έπρεπε να γράφεται \"μαγιονΑΙζα\" αφού από όλους, παίρνει ένα μεγάλο ΝΑΙ!",
        price: "Από 0,50€"
      }
    ]
  },
  {
    category: "Ορεκτικά",
    icon: <Utensils className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Hakuna Patata",
        description: "Πατάτες τηγανητές με λιωμένο cheddar & crispy μπέικον",
        price: "5,80€"
      },
      {
        name: "Μπουγιουρντί",
        description: "Παραδοσιακό μπουγιουρντί σε πήλινο με φέτα",
        price: "5,80€"
      },
      {
        name: "Κροκέτες 4 τυριών",
        description: "4 Τεμάχια. Συνοδεύονται από μαρμελάδα ντομάτας",
        price: "5,60€"
      },
      {
        name: "Κεφαλοτύρι σαγανάκι",
        description: "Συνοδεύεται από chutney ντομάτας",
        price: "6,00€"
      },
      {
        name: "Πατάτες τηγανητές",
        description: "Φρεσκοκομμένες πατάτες τηγανητές",
        price: "3,50€"
      },
      {
        name: "Φέτα",
        description: "Πιάτο δίχως φέτα δεν έχει νοστιμάδα! Πρόσθεσε φέτα στην παραγγελία σου και συνδύασέ την με σαλάτα για ένα ολοκληρωμένο γεύμα.",
        price: "3,50€"
      },
      {
        name: "Καυτερή πιπεριά",
        description: "",
        price: "1,50€"
      },
      {
        name: "Πίτα παραδοσιακή",
        description: "Σκέτη",
        price: "0,50€"
      },
      {
        name: "Ψωμί",
        description: "Μερίδα",
        price: "0,50€"
      }
    ]
  },
  {
    category: "Σαλάτες",
    icon: <Salad className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Caesar's",
        description: "Σαλάτα με iceberg, ντοματίνια, κρουτόν, μπέικον, κοτόπουλο, καλαμπόκι, παρμεζάνα",
        price: "7,40€"
      },
      {
        name: "Healthy",
        description: "Σαλάτα με ανάμεικτα baby λαχανικά, φιλέτο πράσινου μήλου, πούδρα παρμεζάνας, μαύρο σουσάμι, ντοματίνια, ξηροί καρποί & dressing βαλσάμικο",
        price: "6,20€"
      },
      {
        name: "Pumba",
        description: "Σαλάτα με ανάμεικτα baby λαχανικά, ντοματίνια, παρμεζάνα, απάκι & dressing βαλσάμικου",
        price: "6,70€"
      },
      {
        name: "Χωριάτικη",
        description: "Ντομάτα, αγγούρι, κρεμμύδι, πιπεριά, ελιές & φέτα ΠΟП",
        price: "7,40€"
      },
      {
        name: "Ντάκος",
        description: "Καρέ ντομάτας, κρεμμύδι, ελιές, κάππαρη, φέτα ΠΟП & κρητικό ντάκο",
        price: "6,00€"
      },
      {
        name: "Αγγουροτομάτα",
        description: "Σαλάτα με ντομάτα, αγγούρι, φρέσκο κρεμμύδι, ξηρό κρεμμύδι, πιπεριά πράσινη & πιπεριά κόκκινη",
        price: "5,00€"
      },
      {
        name: "Πικάντικη",
        description: "Σαλάτα με λάχανο λευκό, λάχανο κόκκινο, καρότο, πιπεριά πράσινη & σέλινο",
        price: "4,50€"
      },
      {
        name: "Μαρούλι",
        description: "Σαλάτα με μαρούλι, αγγούρι & φρέσκο κρεμμύδι",
        price: "4,50€"
      }
    ]
  },
  {
    category: "Τεμάχια",
    icon: <Beef className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Σουβλάκι χοιρινό",
        description: "",
        price: "Από 1,60€"
      },
      {
        name: "Πανσέτα",
        description: "",
        price: "Από 1,60€"
      },
      {
        name: "Φιλέτο κοτόπουλο μπούτι",
        description: "",
        price: "Από 2,40€"
      },
      {
        name: "Φιλέτο κοτόπουλο στήθος",
        description: "",
        price: "Από 2,10€"
      },
      {
        name: "Σουβλάκι κοτόπουλο",
        description: "",
        price: "Από 1,60€"
      },
      {
        name: "Κοτομπέικον",
        description: "",
        price: "Από 1,90€"
      },
      {
        name: "Σνίτσελ κοτόπουλο",
        description: "",
        price: "Από 2,00€"
      },
      {
        name: "Λουκάνικο Βαυαρίας",
        description: "",
        price: "Από 1,90€"
      },
      {
        name: "Σουτζουκάκι",
        description: "",
        price: "Από 1,60€"
      },
      {
        name: "Σουτζουκάκι γεμιστό με Philadelphia",
        description: "",
        price: "Από 2,00€"
      },
      {
        name: "Μπιφτέκι μοσχαρίσιο",
        description: "",
        price: "Από 2,10€"
      },
      {
        name: "Μπιφτέκι γεμιστό με gouda",
        description: "",
        price: "Από 2,00€"
      },
      {
        name: "Μπιφτέκι λαχανικών",
        description: "",
        price: "Από 1,90€"
      },
      {
        name: "Σουβλάκι μανιτάρια & ντοματίνια",
        description: "",
        price: "Από 1,50€"
      }
    ]
  },
  {
    category: "Σάντουιτς",
    icon: <Sandwich className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Γύρος χοιρινός σε σάντουιτς",
        description: "Σάντουιτς γύρος χοιρινός με τα υλικά της επιλογής σας",
        price: "Από 4,40€"
      },
      {
        name: "Σουβλάκι χοιρινό σε σάντουιτς",
        description: "Σάντουιτς σουβλάκι χοιρινό με τα υλικά της επιλογής σας",
        price: "Από 4,00€"
      },
      {
        name: "Σουβλάκι κοτόπουλο σε σάντουιτς",
        description: "Σάντουιτς σουβλάκι κοτόπουλο με τα υλικά της επιλογής σας",
        price: "Από 4,00€"
      },
      {
        name: "Πανσέτα χοιρινή σε σάντουιτς",
        description: "Σάντουιτς πανσέτα χοιρινή με τα υλικά της επιλογής σας",
        price: "Από 4,00€"
      },
      {
        name: "Φιλέτο κοτόπουλο στήθος σε σάντουιτς",
        description: "Σάντουιτς φιλέτο κοτόπουλο στήθος με τα υλικά της επιλογής σας",
        price: "Από 4,00€"
      },
      {
        name: "Φιλέτο κοτόπουλο μπούτι σε σάντουιτς",
        description: "Σάντουιτς φιλέτο κοτόπουλο μπούτι με τα υλικά της επιλογής σας",
        price: "Από 4,00€"
      },
      {
        name: "Σουτζουκάκι σε σάντουιτς",
        description: "Σάντουιτς σουτζουκάκι με τα υλικά της επιλογής σας",
        price: "Από 4,00€"
      },
      {
        name: "Κοτομπουκιές σε σάντουιτς",
        description: "Σάντουιτς κοτομπουκιές με τα υλικά της επιλογής σας",
        price: "Από 4,00€"
      },
      {
        name: "Κοτομπέικον σε σάντουιτς",
        description: "Σάντουιτς κοτομπέικον με τα υλικά της επιλογής σας",
        price: "Από 4,00€"
      },
      {
        name: "Σνίτσελ κοτόπουλο σε σάντουιτς",
        description: "Σάντουιτς σνίτσελ κοτόπουλο με τα υλικά της επιλογής σας",
        price: "Από 4,00€"
      },
      {
        name: "Λουκάνικο Βαυβαρίας σε σάντουιτς",
        description: "Σάντουιτς λουκάνικο Βαυβαρίας με τα υλικά της επιλογής σας",
        price: "Από 3,90€"
      },
      {
        name: "Σουτζουκάκι γεμιστό με Philadelphia σε σάντουιτς",
        description: "Σάντουιτς σουτζουκάκι γεμιστό με Philadelphia με τα υλικά της επιλογής σας",
        price: "Από 4,20€"
      },
      {
        name: "Μπιφτέκι μοσχαρίσιο σε σάντουιτς",
        description: "Σάντουιτς μπιφτέκι μοσχαρίσιο με τα υλικά της επιλογής σας",
        price: "Από 3,80€"
      },
      {
        name: "Μπιφτέκι γεμιστό με gouda σε σάντουιτς",
        description: "Σάντουιτς μπιφτέκι μοσχαρίσιο γεμιστό με Philadelphia με τα υλικά της επιλογής σας",
        price: "Από 3,80€"
      },
      {
        name: "Μπιφτέκι λαχανικών σε σάντουιτς",
        description: "Σάντουιτς μπιφτέκι λαχανικών με τα υλικά της επιλογής σας",
        price: "Από 3,80€"
      },
      {
        name: "Σουβλάκι μανιτάρια & ντοματίνια σε σάντουιτς",
        description: "Σάντουιτς σουβλάκι μανιτάρια & ντοματίνια με τα υλικά της επιλογής σας",
        price: "Από 3,70€"
      },
      {
        name: "Καλαμαράκια πανέ σε σάντουιτς",
        description: "Σάντουιτς καλαμαράκια πανέ με τα υλικά της επιλογής σας",
        price: "Από 4,10€"
      },
      {
        name: "Πατατόπιτα σε σάντουιτς",
        description: "Σάντουιτς χωρίς κρέας με τα υλικά της επιλογής σας",
        price: "Από 2,70€"
      }
    ]
  },
  {
    category: "Αθηναϊκή πίτα",
    icon: <Pizza className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Σουβλάκι χοιρινό σε Αθηναϊκή πίτα",
        description: "Αθηναϊκή πίτα 16cm σουβλάκι χοιρινό με τα υλικά της επιλογής σας",
        price: "Από 2,50€"
      },
      {
        name: "Σουβλάκι κοτόπουλο σε Αθηναϊκή πίτα",
        description: "Αθηναϊκή πίτα 16cm σουβλάκι κοτόπουλο με τα υλικά της επιλογής σας",
        price: "Από 2,50€"
      },
      {
        name: "Πανσέτα χοιρινή σε Αθηναϊκή πίτα",
        description: "Αθηναϊκή πίτα 16cm πανσέτα χοιρινή με τα υλικά της επιλογής σας",
        price: "Από 2,50€"
      },
      {
        name: "Σουτζουκάκι σε Αθηναϊκή πίτα",
        description: "Αθηναϊκή πίτα 16cm σουτζουκάκι με τα υλικά της επιλογής σας",
        price: "Από 2,50€"
      }
    ]
  },
  {
    category: "Τυλιχτά Πίτες",
    icon: <Pizza className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Γύρος Χοιρινός",
        description: "Πίτα, γύρος χοιρινός, ντομάτα, κρεμμύδι, πατάτες, σως",
        price: "4,70€",
        featured: true
      },
      {
        name: "Γύρος Κοτόπουλο",
        description: "Πίτα, γύρος κοτόπουλο, ντομάτα, κρεμμύδι, πατάτες, σως",
        price: "4,70€"
      },
      {
        name: "Καλαμάκι Χοιρινό",
        description: "Πίτα, καλαμάκι χοιρινό, ντομάτα, κρεμμύδι, πατάτες, σως",
        price: "3,80€"
      },
      {
        name: "Καλαμάκι Κοτόπουλο",
        description: "Πίτα, καλαμάκι κοτόπουλο, ντομάτα, κρεμμύδι, πατάτες, σως",
        price: "3,80€"
      }
    ]
  },
  {
    category: "Μερίδες",
    icon: <Utensils className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Γύρος Χοιρινός",
        description: "Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & τζατζίκι",
        price: "8,60€",
        featured: true
      },
      {
        name: "Γύρος Κοτόπουλο",
        description: "Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & σως μουστάρδας",
        price: "8,60€"
      },
      {
        name: "Σουβλάκι Χοιρινό",
        description: "4 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & τζατζίκι",
        price: "7,80€"
      },
      {
        name: "Σουβλάκι κοτόπουλο μερίδα",
        description: "4 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & σως μουστάρδας",
        price: "7,80€"
      },
      {
        name: "Πανσέτα μερίδα",
        description: "3 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & τζατζίκι",
        price: "7,70€"
      },
      {
        name: "Φιλέτο κοτόπουλο στήθος μερίδα",
        description: "2 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & σως μουστάρδας",
        price: "7,70€"
      },
      {
        name: "Φιλέτο κοτόπουλο μπούτι μερίδα",
        description: "2 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & σως μουστάρδας",
        price: "7,70€"
      },
      {
        name: "Κοτομπουκιές μερίδα",
        description: "Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & σως μουστάρδας",
        price: "7,70€"
      },
      {
        name: "Κοτομπέικον μερίδα",
        description: "3 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & σως μουστάρδας",
        price: "8,10€"
      },
      {
        name: "Σνίτσελ κοτόπουλο μερίδα",
        description: "2 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & σως μουστάρδας",
        price: "7,70€"
      },
      {
        name: "Λουκάνικο Βαυβαρίας μερίδα",
        description: "3 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & τζατζίκι",
        price: "7,70€"
      },
      {
        name: "Σουτζουκάκι μερίδα",
        description: "4 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & τζατζίκι",
        price: "7,80€"
      },
      {
        name: "Σουτζουκάκι γεμιστό με Philadelphia μερίδα",
        description: "3 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & τζατζίκι",
        price: "8,10€"
      },
      {
        name: "Μπιφτέκι Μοσχαρίσιο",
        description: "3 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & τζατζίκι",
        price: "8,10€"
      },
      {
        name: "Μπιφτέκι γεμιστό με gouda μερίδα",
        description: "3 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & τζατζίκι",
        price: "7,70€"
      },
      {
        name: "Μπιφτέκι λαχανικών μερίδα",
        description: "3 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & τζατζίκι",
        price: "7,30€"
      },
      {
        name: "Σουβλάκι μανιτάρια & ντοματίνια μερίδα",
        description: "3 Τεμάχια. Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & σως μουστάρδας",
        price: "6,50€"
      },
      {
        name: "Καλαμαράκια πανέ μερίδα",
        description: "Συνοδεύεται από πίτα, ανάμεικτη σαλάτα, πατάτες τηγανητές & σως μουστάρδας",
        price: "8,10€"
      }
    ]
  },
  {
    category: "Club Sandwiches",
    icon: <Sandwich className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Club sandwich κλασικό",
        description: "Με ζαμπόν, μπέικον, gouda, ντομάτα, μαρούλι & μαγιονέζα. Συνοδεύεται από πατάτες τηγανητές",
        price: "Από 6,00€",
        featured: true
      },
      {
        name: "Club sandwich κοτόπουλο",
        description: "Με φιλέτο κοτόπουλο, ζαμπόν, μπέικον, gouda, ντομάτα, μαρούλι & μαγιονέζα. Συνοδεύεται από πατάτες τηγανητές",
        price: "Από 6,70€"
      }
    ]
  },
  {
    category: "Pumba Special",
    icon: <Utensils className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Σκεπαστή Γύρος Χοιρινός",
        description: "2 Πίτες 21cm με γύρο χοιρινό, gouda & σως μουστάρδας. Με πατάτες τηγανητές",
        price: "6,90€",
        featured: true
      },
      {
        name: "Σκεπαστή γύρος κοτόπουλο",
        description: "2 Πίτες 21cm με γύρο κοτόπουλο, gouda & σως μουστάρδας. Συνοδεύεται από πατάτες τηγανητές",
        price: "Από 6,90€"
      },
      {
        name: "Alabao λαγάνα γύρος χοιρινός",
        description: "Με γύρο χοιρινό, πατάτες τηγανητές, λάχανο, σως γιαουρτιού, ketchup & μουστάρδα",
        price: "Από 5,90€"
      },
      {
        name: "Alabao λαγάνα γύρος κοτόπουλο",
        description: "Με γύρο κοτόπουλο, πατάτες τηγανητές, λάχανο, σως γιαουρτιού, ketchup & μουστάρδα",
        price: "Από 5,90€"
      },
      {
        name: "Alabao μπαγκέτα γύρος χοιρινός",
        description: "Με γύρο χοιρινό, πατάτες τηγανητές, λάχανο, ketchup, μουστάρδα & σως Pumba",
        price: "Από 5,90€"
      },
      {
        name: "Alabao μπαγκέτα γύρος κοτόπουλο",
        description: "Με γύρο κοτόπουλο, πατάτες τηγανητές, λάχανο, ketchup, μουστάρδα & σως Pumba",
        price: "Από 5,90€"
      },
      {
        name: "Μπαζούκας γύρος χοιρινός",
        description: "Τορτίγια με γύρο χοιρινό, αγγουροντομάτα, μαρούλι, ketchup, μουστάρδα, σως γιαουρτιού, πατάτες τηγανητές & κεφαλοτύρι",
        price: "Από 5,60€"
      },
      {
        name: "Μπαζούκας γύρος κοτόπουλο",
        description: "Τορτίγια με γύρο κοτόπουλο, αγγουροντομάτα, μαρούλι, ketchup, μουστάρδα, σως μουστάρδας, πατάτες τηγανητές & κεφαλοτύρι",
        price: "Από 5,60€"
      },
      {
        name: "Alabao Λαγάνα Γύρος",
        description: "Με γύρο χοιρινό, πατάτες, λάχανο, σως γιαουρτιού, ketchup & μουστάρδα",
        price: "5,90€"
      },
      {
        name: "Μπαζούκας Γύρος",
        description: "Τορτίγια με γύρο χοιρινό, αγγουροντομάτα, μαρούλι & κεφαλοτύρι",
        price: "5,60€"
      },
      {
        name: "Clubisio Γύρος",
        description: "2 Ατόμων. 3 Χειροποίητες πίτες 20cm με γύρο χοιρινό, gouda & μπέικον",
        price: "9,80€"
      }
    ]
  },
  {
    category: "Pumba Premium",
    icon: <Utensils className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Μπριζόλα μοσχαρίσια μερίδα",
        description: "Συνοδεύεται από πατάτες τηγανητές, σαλάτα & dip της επιλογής σας",
        price: "Από 20,00€",
        featured: true
      },
      {
        name: "Chaos burger",
        description: "Ψωμάκι brioche με μπιφτέκι Black Angus 150gr, ξεροψημένο μπέικον, χειροποίητη mousse φέτας, σως Jack Daniel's, ντομάτα & πίκλες αγγουριού. Συνοδεύεται από πατάτες τηγανητές",
        price: "Από 8,30€",
        featured: true
      },
      {
        name: "Clubisio γύρος χοιρινός",
        description: "2 Ατόμων. 3 Χειροποίητες πίτες 20cm με γύρο χοιρινό, gouda, ξεροψημένο μπέικον, σως γιαουρτιού, ντομάτα & μαρούλι. Συνοδεύεται από πατάτες τηγανητές",
        price: "Από 9,80€",
        featured: true
      },
      {
        name: "Clubisio γύρος κοτόπουλο",
        description: "2 Ατόμων. 3 Χειροποίητες πίτες 20cm με γύρο κοτόπουλο, gouda, ξεροψημένο μπέικον, σως γιαουρτιού, ντομάτα & μαρούλι. Συνοδεύεται από πατάτες τηγανητές",
        price: "Από 9,80€"
      },
      {
        name: "Μπριζόλα Tomahawk",
        description: "Συνοδεύεται από πατάτες τηγανητές & σως Pumba",
        price: "12,00€",
        featured: true
      }
    ]
  },
  {
    category: "Burgers",
    icon: <Beef className="text-pumba-red" size={24} />,
    items: [
      {
        name: "Pumba Double Burger",
        description: "Ψωμάκι brioche με 2 μπιφτέκια μοσχαρίσια, διπλό cheddar & μπέικον",
        price: "7,60€",
        featured: true
      },
      {
        name: "Cheeseburger",
        description: "Ψωμάκι brioche με μπιφτέκι μοσχαρίσιο, cheddar, ντομάτα & μαρούλι",
        price: "5,00€"
      },
      {
        name: "Ham burger",
        description: "Ψωμάκι brioche με σουσάμι με μπιφτέκι μοσχαρίσιο, ντομάτα, αγγουρομαγιονέζα, ketchup & μουστάρδα",
        price: "4,80€"
      },
      {
        name: "Crispy Schnitzel Burger",
        description: "Ψωμάκι brioche με σνίτσελ κοτόπουλο, μπέικον, ντομάτα & iceberg",
        price: "5,00€"
      },
      {
        name: "Soki's burger",
        description: "Ψωμάκι brioche με μπιφτέκι μοσχαρίσιο, λιωμένο cheddar, ντομάτα, sweet chili & μαγιονέζα μαύρης τρούφας",
        price: "6,40€"
      },
      {
        name: "Nala's burger",
        description: "Ψωμάκι brioche με mesclun, chutney ντομάτας, κεφαλοτύρι σαγανάκι, πίκλες αγγουριού & ντομάτα",
        price: "4,90€"
      },
      {
        name: "Vegetarian burger",
        description: "Ψωμάκι brioche με μπιφτέκι λαχανικών, iceberg, ντομά
